<h1><b>Will You Survive On Titanic AI</b></h1>
<h2>Importing Libraries and Database</h2>

In [2]:
import numpy as np
import random as rn
import pandas as pd
import seaborn as sns

In [3]:
titanic = pd.read_csv(r"titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [3]:
# sns.pairplot(titanic, hue="Survived")

<h1>Data Cleanup</h1>

In [4]:
titanic = titanic.drop(columns=['Name', 'Cabin','Embarked','Ticket','PassengerId','WikiId','Name_wiki','Age_wiki','Hometown','Boarded','Destination','Lifeboat','Body','Class'])
titanic = titanic[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived']]
titanic.head()

   Pclass     Sex   Age  SibSp  Parch     Fare  Survived
0       3    male  22.0      1      0   7.2500       0.0
1       1  female  38.0      1      0  71.2833       1.0
2       3  female  26.0      0      0   7.9250       1.0
3       1  female  35.0      1      0  53.1000       1.0
4       3    male  35.0      0      0   8.0500       0.0

In [6]:
class DataProcessing:
    @staticmethod
    def shuffle(x):
        for i in range(len(x)-1,0,-1):
            j=rn.randint(0,i-1)
            x.iloc[j], x.iloc[i] = x.iloc[i], x.iloc[j]
            
    @staticmethod
    def normalization(x):
        values=x.select_dtypes(exclude="object")
        columnNames=values.columns.tolist()
        for column in columnNames[:-1]:
            data = x.loc[:,column]
            max1=max(data)
            min1=min(data)
            for row in range(0,len(x),1):
                xprim=(x.at[row,column]-min1)/(max1-min1)
                x.at[row,column]=xprim 
                
    @staticmethod
    def split(x,k):
        return x[:int(len(x)*k//1)], x[int(len(x)*k//1 +1):]

In [7]:
DataProcessing.shuffle(titanic)

In [8]:


for row in range(len(titanic)-1,-1,-1):
    if titanic.at[row,'Sex']=="male":
        titanic.at[row,'Sex']=1
    elif titanic.at[row,'Sex']=="female":
        titanic.at[row,'Sex']=0
    else:
        titanic = titanic.drop(row,axis=0)

        
# values=titanic.select_dtypes(exclude="object")
# columnNames=values.columns.tolist()
# for column in columnNames:
# column = "PassengerId"
# for row in range(len(titanic)-1,-1,-1):
#     print(titanic.at[row,column])
#     temp = titanic.at[row,column]
#     if isinstance(temp, (int, float, complex)):
#         print(titanic.at[row,column])
        
        
#     else:
#         print(titanic.iloc[row])
#         titanic = titanic.drop(row,axis=0)


titanic.head()

   Pclass Sex   Age  SibSp  Parch     Fare  Survived
0       2   0  54.0      1      3  23.0000       1.0
1       3   1  20.0      0      0   9.5000       0.0
2       3   1   NaN      0      0   7.2292       NaN
3       1   0  24.0      0      0  49.5042       1.0
4       2   1  49.0      1      2  65.0000       NaN

In [9]:
DataProcessing.normalization(titanic)
titanic.head()

   Pclass Sex       Age  SibSp     Parch      Fare  Survived
0     0.5   0  0.674308  0.125  0.333333  0.044893       1.0
1     1.0   1  0.248403  0.000  0.000000  0.018543       0.0
2     1.0   1       NaN  0.000  0.000000  0.014110       NaN
3     0.0   0  0.298509  0.000  0.000000  0.096626       1.0
4     0.5   1  0.611675  0.125  0.222222  0.126872       NaN

In [10]:
titanic = titanic.dropna()

titanic.head()

    Pclass Sex       Age  SibSp     Parch      Fare  Survived
0      0.5   0  0.674308  0.125  0.333333  0.044893       1.0
1      1.0   1  0.248403  0.000  0.000000  0.018543       0.0
3      0.0   0  0.298509  0.000  0.000000  0.096626       1.0
7      1.0   1  0.693098  0.000  0.000000  0.015713       0.0
10     1.0   1  0.398722  0.000  0.000000  0.016323       0.0

In [11]:
trainingSet, validatingSet = DataProcessing.split(titanic,0.7)

In [12]:
titanic

      Pclass Sex       Age  SibSp     Parch      Fare  Survived
0        0.5   0  0.674308  0.125  0.333333  0.044893       1.0
1        1.0   1  0.248403  0.000  0.000000  0.018543       0.0
3        0.0   0  0.298509  0.000  0.000000  0.096626       1.0
7        1.0   1  0.693098  0.000  0.000000  0.015713       0.0
10       1.0   1  0.398722  0.000  0.000000  0.016323       0.0
...      ...  ..       ...    ...       ...       ...       ...
1304     1.0   0  0.498935  0.125  0.000000  0.018494       0.0
1305     1.0   1  0.235876  0.000  0.000000  0.015713       0.0
1306     1.0   1  0.235876  0.000  0.000000  0.015412       0.0
1307     1.0   0  0.373669  0.000  0.000000  0.016908       0.0
1308     0.5   0  0.022924  0.125  0.111111  0.050749       1.0

[714 rows x 7 columns]

<h2>k-nearest neighbors algorithm</h2>

In [13]:
class Knn:
    @staticmethod
    def knn(x,element,k=1):
        dist = []
        y = 0
        for i in range(len(x)):
            sum = 0
            for j in range(len(element)-1):
                sum += (x.iloc[i,j] - element.iloc[j])**2
            dist.append(sum**(1/2))
        x.loc[:,"dist"]=dist
        y = x.sort_values("dist")
        kElementów = {}
        for i in range(k):
            kElementów[y["Survived"].iat[i]] = 0
        for i in range(k):
            kElementów[y["Survived"].iat[i]] +=1
        return max(kElementów, key=kElementów.get)
    @staticmethod
    def accuracy(x,z,k):
        good = 0
        for i in range(len(z)):
            if( Knn.knn(x,z.iloc[i],k) == z.iloc[i][6] ):
                good +=1
        return good/z.shape[0]

In [15]:
Knn.accuracy(trainingSet,validatingSet,3)

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.7663551401869159

In [16]:
#knn test
for i in range(5):
    DataProcessing.shuffle(titanic)
    trainingSet, validatingSet = DataProcessing.split(titanic,0.7)
    print(Knn.accuracy(trainingSet, validatingSet,4))

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8130841121495327

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8084112149532711

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.7523364485981309

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8130841121495327

C:\Users\user\AppData\Local\Temp\ipykernel_21780\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8037383177570093

In [15]:
validatingSet.head()

     Pclass Sex       Age  SibSp     Parch      Fare  Survived
288     0.5   0  0.393380  0.000  0.000000  0.025374         1
289     0.0   1  0.591191  0.000  0.000000  0.057971         0
290     0.5   1  0.340630  0.000  0.000000  0.025374         0
291     0.5   0  0.314256  0.125  0.222222  0.126872         1
293     0.0   1  0.314256  0.125  0.000000  0.160574         0

<h2>Naive Bayes Algorithm</h2>

In [18]:
class NaiveBayes:
    @staticmethod
    def mean(column):
        return sum(column)/len(column)
    @staticmethod
    def stv(column, mean1):
        tmp=0
        for i in column:
            tmp+=(i-mean1)**2
        return np.sqrt(tmp/len(column))
    @staticmethod
    def gaussProbability(x, mu, sigma):
        if sigma == 0:
            return 0
        exponent=np.exp(-0.5*(x-mu)**2/(sigma**2))
        return 1/(sigma*np.sqrt(2*np.pi))*exponent
    @staticmethod
    def classify(x, sample):
        probability = []
        for className in x['Survived'].unique().tolist():
            p1 = 1
            columns = x.columns.tolist()[:-1]
            data = x[x['Survived'] == className]
            for column in columns:
                dataFromOneColumn = data[column]
                mu = NaiveBayes.mean(dataFromOneColumn)
                sigma = NaiveBayes.stv(dataFromOneColumn, mu)
                prob = NaiveBayes.gaussProbability(sample[column], mu, sigma)
                p1 *= prob
            p2 = x['Survived'].value_counts()[className]
            probability.append(p1*p2/len(x))
        maxIdx = probability.index(max(probability))
        return x['Survived'].unique().tolist()[maxIdx]
    @staticmethod
    def accuracy(trainSet, valSet):
        positiveCases = 0
        for idx, i in valSet.iterrows():
            if i['Survived'] == NaiveBayes.classify(trainSet, i):
                positiveCases += 1
        return positiveCases / len(valSet)

In [19]:
#naive test
arr = []
for i in range(20):
    DataProcessing.shuffle(titanic)
    arr.append(NaiveBayes.accuracy(trainingSet, validatingSet))
print(arr)
print(sum(arr)/len(arr))

[0.35046728971962615, 0.4252336448598131, 0.3925233644859813, 0.37383177570093457, 0.4252336448598131, 0.3878504672897196, 0.37383177570093457, 0.3411214953271028, 0.411214953271028, 0.3644859813084112, 0.3644859813084112, 0.43457943925233644, 0.35514018691588783, 0.37850467289719625, 0.4205607476635514, 0.3925233644859813, 0.34579439252336447, 0.411214953271028, 0.3644859813084112, 0.4392523364485981]
0.3876168224299065